# Домашнее задание к работе 9

## Условие задачи
Написать программу, выводящую на экран заданную геометрическую фигуру, нарисованную с помощью заданного с клавиатуры символа, условие заполнения фигуры и задаваемые параметры фигуры в таблице (остальные можно взять константные)
Вариант 3 - Прямоугольный треугольник

## 1. Алгоритм и блок-схема
### Алгоритм
1. **Начало**
2. Задать исходные данные:
   char
   -symbol
   
   int
   -a
   -b
4. Цикл for:
    -for (int i = 1; i <= a; i++) { for (int j = 1; j <= i * b / a; j++) {printf("%c ", symbol);} printf("\n"); }
5. Вывод результата:
   -циклом printf("%c ", symbol);
6. **Конец**

## 2. Реализация программы
#include <stdio.h> 
#include <locale.h>

int main() {
    //variant 3
    setlocale(LC_CTYPE, "");
    char symbol;
    int a, b;

    printf("Введите символ для рисования: ");
    scanf("%c", &symbol);

    printf("Введите длину a: ");
    scanf("%d", &a);

    printf("Введите длину b: ");
    scanf("%d", &b);
    printf("\nПрямоугольный треугольник:\n\n");

    for (int i = 1; i <= a; i++) {
        for (int j = 1; j <= i * b / a; j++) {
            printf("%c ", symbol);
        }
        printf("\n");
    }
    printf("\nОчень красиво!\n");
    system("pause");
    return 0;
}

## 3. Результаты работы программы
Введите символ для рисования: *
Введите длину a: 5
Введите длину b: 8

Прямоугольный треугольник:

*
* * *
* * * *
* * * * * *
* * * * * * * *

Очень красиво!
Для продолжения нажмите любую клавишу . . .

## 4. Информация о разработчике
Чумачек Владислав, бИЦ-252
